{
  "main": {
    "name": "Liuming Huang",
    "occupation": "Software Engineer",
    "major": "Computer Science & Data Science",
    "description": " 4th year Computer Science & Data Science student studying in University of Toronto",
    "image": "profilepic.jpg",
    "bio": "I'm a fourth-year Computer Science & Data Science student with strong problem-solving skills and a desire to explore the tech industry. I love working on new frameworks and making software accessible to all. Proven quick learner with the ability to work under pressure both independently and in a team as seen in the co-op role. Always eager to learn and striving to improve!",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "liuming.huang@mail.utoronto.ca",
    "phone": "647-518-6097",
    "address": {
      "street": "15 Singer Crt",
      "city": "Toronto",
      "state": "Ontario",
      "zip": "M2K 0B1"
    },
    "website": "https://www.liuminghuang.com",
    "resumedownload": "RESUME.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/liuming-huang",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/huangl68/",
        "className": "fa fa-github"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/lmamhuang/",
        "className": "fa fa-instagram"
      }
      
    ]
  },
  "resume": {
    "skillmessage": "I always interested in playing aroung with new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "University of Toronto",
        "degree": "Bachelor of Science",
        "graduated": "2017-2022",
        "description": ["Double specialist in Computer Science and Data Science", 
          "Cumulative GPA 3.53/4.0", 
          "Dean’s List Scholar in the Faculty of Arts and Science "]
      }
    ],
    "work": [
      {
        "company": "Visa Consulting & Analytics",
        "title": "Software Developer (Remote Internship)",
        "location": "Shanghai, China",
        "years": "Apr 2021 - Aug 2021",
        "description":  ["Researched in open source projects about Federated Machine Learning and measured the runtime & accuracy of algorithms", 
          "Developed a Python Dashboard used by 10 staffs to simply drag & drop datasets" , 
          "Used Docker Compose to orchestrate multiple containers that work together and set up environments"]
      },
      {
        "company": "Proofpoint",
        "location": "Toronto, Canada",
        "title": "QA Automation Engineer Co-op",
        "years": "May 2020 - Aug 2021",
        "description":  ["Built automation framework using Selenium and C# to automate testing of web applications", 
          "Created new helper functions by using REST API to generate test data, and improved average 50% running time reduction during each test run" , 
          "Experienced in Agile Development process for diverse requirements"]
      }
    ],
    "skills": [
      {
        "name": "Java",
        "description": "I have developed several projects using Java. Frameworks like Spring boot also makes developmwent much easier. ",
        "image": "java.jpg"
      },
      
      {
        "name": "React Js",
        "description": "The most popular frontend framework now. I have built ReactJS based websites such as budget planning website and my personal website.",
        "image": "react.jpg"
      },

      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have used Git for version control for personal projects and also in teams.",
        "image": "git.jpg"
      },

      
      {
        "name": "Python",
        "description": "It is by far the language I am most familiar with in terms of data-structure and algorithm programming. I also use Python for machine learning development.",
        "image": "python.jpg"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "mongo.jpg"
      },
      {
        "name": "AWS",
        "description": "I use AWS Route 53 services to register and manage my domains. I'm also preparing for AWS certified developer associate exam.",
        "image": "aws.jpg"
      },
      
      {
        "name": "Node JS",
        "description": "Node JS is my server-side scripting language of choice. It makes things easier for building and deploying.",
        "image": "node.jpg"
      },
      {
        "name": "Bootstrap 4",
        "description": "I use Bootstrap more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image": "bootstrap.jpg"
      }
      
      
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Game Center App",
        "category": "A game center application consists of three different games",
        "image": "2048.png",
        "url": "https://github.com/huangl68/GameCenter"
      },
      {
        "title": "Budgeting Web Application",
        "category": "Web application to track monthly spent",
        "image": "Budgeting-App.png",
        "url": "https://github.com/huangl68/BudgetWebApp"
      },
      {
        "title": "Liver Cancer Subtype Detection Data Analysis",
        "category": "Using python & machine learning algorithms to seperate patients into groups.",
        "image": "Subtype-Detection.png",
        "url": "https://github.com/huangl68/Subtype-Detection"
      },
      {
        "title": "Personal Website",
        "category": "A React based personal website",
        "image": "resume-website.png",
        "url": "http://www.liuminghuang.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
